; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph1 - mode
	image0 - mode
	Star4 - direction
	GroundStation5 - direction
	Star2 - direction
	Star3 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Planet20 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star2)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Phenomenon6 image0)
	(have_image Planet7 thermograph1)
	(have_image Planet8 image0)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 image0)
	(have_image Star11 image0)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 thermograph1)
	(have_image Planet16 image0)
	(have_image Star17 thermograph1)
	(have_image Phenomenon18 image0)
	(have_image Phenomenon19 thermograph1)
	(have_image Planet20 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 16
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 16
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 16
4. (turn_to satellite0 phenomenon15 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 16
5. (take_image satellite0 phenomenon15 instrument1 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 1 of 16
6. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 16
7. (take_image satellite0 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 2 of 16
8. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 16
9. (take_image satellite0 phenomenon13 instrument1 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 16
10. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 16
11. (take_image satellite0 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 16
12. (turn_to satellite0 phenomenon18 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon18)
   goals met: 4 of 16
13. (take_image satellite0 phenomenon18 instrument1 image0)
   added: (have_image phenomenon18 image0)
   goals met: 5 of 16
14. (turn_to satellite0 phenomenon19 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon19)
   goals met: 5 of 16
15. (take_image satellite0 phenomenon19 instrument1 thermograph1)
   added: (have_image phenomenon19 thermograph1)
   goals met: 6 of 16
16. (turn_to satellite0 phenomenon6 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 16
17. (take_image satellite0 phenomenon6 instrument1 image0)
   added: (have_image phenomenon6 image0)
   goals met: 7 of 16
18. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 16
19. (take_image satellite0 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 8 of 16
20. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 8 of 16
21. (take_image satellite0 planet10 instrument1 image0)
   added: (have_image planet10 image0)
   goals met: 9 of 16
22. (turn_to satellite0 planet16 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet16)
   goals met: 9 of 16
23. (take_image satellite0 planet16 instrument1 image0)
   added: (have_image planet16 image0)
   goals met: 10 of 16
24. (turn_to satellite0 planet20 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet20)
   goals met: 10 of 16
25. (take_image satellite0 planet20 instrument1 thermograph1)
   added: (have_image planet20 thermograph1)
   goals met: 11 of 16
26. (turn_to satellite0 planet7 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet7)
   goals met: 11 of 16
27. (take_image satellite0 planet7 instrument1 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 12 of 16
28. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 12 of 16
29. (take_image satellite0 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 13 of 16
30. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 13 of 16
31. (take_image satellite0 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 14 of 16
32. (turn_to satellite0 star17 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star17)
   goals met: 14 of 16
33. (take_image satellite0 star17 instrument1 thermograph1)
   added: (have_image star17 thermograph1)
   goals met: 15 of 16
34. (turn_to satellite0 star4 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star4)
   goals met: 16 of 16
